import React from 'react';
import { Link } from 'react-router-dom';

const Terms = props => {
    const locale = props.match.params.locale;
    const translations = {
        ua:<React.Fragment>
        <div className="terms-container">
            <center><h2>Договір надання послуг printlab.biz.ua</h2></center>
            <h3>Преамбула</h3>
            <ol>
                <li>
                    Згідно з Договором  сторона Виконавець, і будь-яка особа, яка прийняла умови цього Договору публічної оферти - Замовник, надалі спільно іменовані - Сторони, уклали цей Договір публічної оферти (далі - Оферта), адресований необмеженому колу осіб, який є офіційною публічною пропозицією Виконавця укласти з Замовниками договір на надання поліграфічних послуг з використанням Веб-сайту <Link to="/" target="_blank" >https://printlab.biz.ua</Link>.
                </li>
                <li>
                Цей Договір-Оферта не вимагає двостороннього підписання і дійсний в електронному вигляді. Договір вважається укладеним і набуває сили договору приєднання з моменту отримання письмового підтвердження Замовником замовлення на надання послуг, в разі відсутності такого підтвердження, з моменту оплати Замовником відповідного замовлення (акцепт договору Замовником). Письмовим підтвердженням замовлення вважається повідомлення, отримане від Замовника факсом, електронною поштою, через форму замовлення на сайті Виконавця (<Link to="/" target="_blank" >https://printlab.biz.ua</Link>), або іншим способом, і що містить явні наміри Замовника укласти з Виконавцем договір на надання послуг. Дії, що підтверджують замовлення, означають, що Замовник приймає повністю і беззастережно всі умови Договору без будь-яких вилучень і / або обмежень.
                </li>
                <li>
                Цей договір-оферта опублікований за адресою: <Link to="/" target="_blank" >https://printlab.biz.ua</Link> Виконавець залишає за собою право вносити зміни в Оферту, в зв'язку з чим Замовник зобов'язується регулярно відслідковувати зміни в Оферті, розміщеної на сайті за відповідною адресою.
                </li>
                <li>
                дійснюючи дії  зіжно з даним публічним договором-офертою, Замовник підтверджує свою правоздатність та дієздатність, досягнення Замовником віку 18 років, а також законне право Замовника вступати в договірні відносини з Виконавцем.
                </li>
            </ol>

            <h3>Загальні положення</h3>
            <ol>
                <li>Виконавець − ФОП "Биля Д.М.", якому належить сайт, і який виробляє друковану продукцію.</li>
                <li>Замовник − будь-яка особа, яка прийняла умови цього Договору публічної оферти і замовляє поліграфічні послуги у Виконавця.</li>
                <li>Сторони: користувач згідно з «Пропонованими можливостями» іменований далі як Замовник та юридична особа іменована надалі як Виконавець.</li>
                <li>Сайт, Сервіс − сайт послуги <Link to="/" target="_blank" >https://printlab.biz.ua</Link>, а також похідний сервіс виробництва друкованої продукції.</li>
                <li>Виконавець надає поліграфічні послуги і виконує поліграфічні замовлення (далі − Замовлення) відповідно до діючого прейскуранта, а Замовник проводить оплату і приймає надані послуги відповідно до умов цього Договору.</li>
                <li>Конкретне найменування, характеристики та інші важливі показники, що надаються вказуються Замовником при оформленні Замовлення вважаються невід'ємною частиною цього Договору.</li>
            </ol>
            <h3>Виробництво продукції</h3>
            <ol>
                <li>Макет − набір візуальних символів, який Замовник передає Виконавцю  для друку за допомогою Сайту і який відповідає параметрам, зазначеним в розділі «Вимоги до макетів» даної Оферти.</li>
                <li>Замовник передає Виконавцю макет відповідно до розділу «Вимоги до макетів» або самостійно несе всю відповідальність за отриманий результат.</li>
                <li>Замовник самостійно несе всю відповідальність за будь-яку інформацію, зазначену в макетах.</li>
                <li>Виконавець надає Послуги протягом термінів і на умовах, погоджених Сторонами при оформленні замовлення. Звичайний термін виконання Замовлення складає від однієї робочої години до двох тижнів, в залежності від його складності.</li>
                <li>Виконавець має право надавати Послуги Замовнику частинами тільки з письмової згоди Замовника.</li>
                <li>Виконавець може відмовити у виконанні послуг без пояснення причин Замовнику.</li>
                <li>Відповідальність Виконавця пов'язана з невиконанням або неналежним виконанням послуги обмежується сумою сплаченої за дану послугу Замовником Виконавцю та не може бути передана третім особам або перенесена на третіх осіб.</li>
                <li>У разі, якщо Замовником порушуються терміни передачі Виконавцю макета, або при виникненні у Замовника необхідності внести в нього зміни або доповнення, Виконавець має право збільшити узгоджений сторонами термін виконання замовлення, повідомивши про це Замовника. При збільшенні за ініціативою Замовника раніше узгодженого обсягу робіт, вартість і термін його виконання узгоджуються Сторонами додатково.</li>
                <li>Виконавець має право в будь-який час на свій розсуд і без інформування Замовника змінювати документи Виконавця «Друк продукції» та «Вимоги до макетів».</li>
                <li>Замовник самостійно визначає необхідний набір послуг в рамках представлених на сайті параметрів замовлення.</li>
                <li>Замовник самостійно визначає матеріал для друку до початку друку на основі макетів Виконавця.</li>
                <li>У разі, якщо макет не відповідає технічним вимогам Виконавця, зазначених у розділі «Вимоги до макету» даної Оферти, Замовник зобов'язується: в триденний термін, за свій рахунок і своїми силами доопрацювати макет і привести його у відповідність з параметрами розділу «Вимоги до макету» даної Оферти, або сповістити Виконавця про необхідність доопрацювання макета силами Виконавця. В цьому випадку, доробка здійснюється за додаткову плату і в узгоджені Сторонами строки, на підставі додаткового рахунку, що виставляється Виконавцем.</li>
                <li>У разі доопрацювання макета Виконавцем і після підписання доопрацьованого оригінал-макету Замовником, вважається, що всі відомості і параметри правильні, претензії до змісту такого макета (або до продукції, виробленої на його підставі) Виконавцем не приймаються.</li>
            </ol>

            <h3 className="subtitle">Вимоги до макетів</h3>

            <h3>Друк продукції</h3>
            <p>В послугах, що надаються допустимі:</p>
            <ol>
                <li>Несуміщення зображення з двох сторін аркуша до 2 мм.</li>
                <li>До 2 мм невідповідність запланованому розміру.</li>
                <li>До 2 мм невідповідність запланованому місцю порізки, висікання, згину, перфорації, тиснення, вибіркового лакування.</li>
                <li>Присутність нерівномірності або неоднорідності в матовому або лаковому покритті.</li>
                <li>Відмінності у відображенні одного і того ж кольору на різних примірниках і в різних місцях одного примірника.</li>
                <li>Відхилення параметрів від пробного примірника.</li>
                <li>Наявність повітряних бульбашок і порошинок в ламінованому і лакованому покритті.</li>
                <li>Наявність тріщин в папері, фарбі, лаковому і ламінованому покритті в місцях згину, биговки, вирубки, висічки, порізки.</li>
                <li>Неплавне відображення переходу з одного кольору в інший.</li>
                <li>Нерівномірність і відставання матового, лакового і ламінованого покриття.</li>
                <li>Загин листа в місці порізу.</li>
                <li>Присутність помилок зроблених замовником, представниками або підрядниками замовника: в тексті, в цифрах, в параметрах кольору, в зображеннях.</li>
                <li>Невідповідність думки будь-якої третьої особи про стан та якість наданих послуг.</li>
                <li>Невідповідність особистого уявлення про результат і сприйняття відображення кольору, контрасту, відносного розміру елементів, кордонів елементів, товщини ліній і елементів друкованого зображення на моніторі і після друку.</li>
                <li>Вбудований в файл колірний профіль буде видалений.</li>
            </ol>

            <h3>Умови відвантаження продукції і доставка</h3>
            <ol>
                <li>Продукція відвантажується по готовності і після 100% передоплати.</li>
                <li>Право власності на Замовлення, а також ризик його випадкової втрати або пошкодження переходять до Замовника з моменту отримання Замовлення.</li>
                <li>Виконавець повідомляє Замовника про надання Послуг одним із таких способів: по телефону, факсом, електронною поштою, шляхом відправки електронного текстового повідомлення. Відправлення такого повідомлення означає наявність готової друкованої продукції на складі Виконавця і готовність друкованої продукції до відвантаження, а також необхідність для Замовника прийняти Продукцію.</li>
                <li>Замовник може забрати / прийняти готову продукцію декількома способами:
                    <ul>
                        <li>ссамостійно і безкоштовно з офісу Виконавця за адресою м.Київ, вул Мстислава Патріарха Скрипника, 40;</li>
                        <li>замовити доставку кур'єром по Києву. Кур'єрська доставка оплачується окремо;</li>
                        <li>оставка по Україні - "Новою Поштою".</li>
                    </ul>
                </li>
            </ol>

            <h3>Оплата і ціна</h3>
            <ol>
                <li>Всі ціни вказані на сайті актуальні протягом одного дня та дійсні тільки для замовлення зробленого безпосередньо з цього сайту за умови стандартного терміну виконання: готовність по мірі виконання.</li>
                <li>Ціна не включає: доставку, виготовлення макета, допрацювання та редагуваннямакета, прискорене виконання замовлення.</li>
                <li>Замовник оплачує послуги Виконавця після перевірки Виконавцем макетів переданих Замовником на відповідність замовленим послуг.</li>
                <li>У разі організації доставки Виконавцем Замовнику, Замовник самостійно оплачує доставку і бере на себе всі ризики пов'язані з невиконанням або неналежним виконанням доставки.</li>
                <li>Розцінки надання послуг розміщені на сайті Виконавця. Замовник знайомиться з ними самостійно. Остаточна вартість Послуг при необхідності може бути узгоджена Сторонами додатково. Вважається, що Замовник, направляючи Виконавцю заявку на надання Послуг, з зазначеними розцінками ознайомлений і згоден на їх застосування.</li>
                <li>Виконавець не несе відповідальності перед Замовником або будь-якою третьою стороною за будь-які зміни, зміни цін, призупинення або припинення Послуг.</li>
                <li>Замовник оплачує Послуги будь-яким із зазначених нижче способів на рахунок Виконавця авансовим платежем у розмірі 100% вартості Послуг протягом трьох банківських днів з моменту підтвердження замовлення. На вимогу Замовника Виконавець виставляє рахунок Замовнику для оплати. Рахунок може бути переданий  електронною поштою, факсом або будь-яким іншим узгодженим Сторонами способом. Підтвердженням оплати є зарахування коштів на рахунок банку-емітента.</li>
                <li>Замовник має право відмовитися від надання Послуг, письмово повідомивши про це Виконавця. В цьому випадку Виконавець зобов'язується повернути Замовнику перераховані грошові кошти, за вирахуванням фактично понесених витрат, а Замовник зобов'язаний відшкодувати Виконавцю збитки, пов'язані з відмовою від виконання зобов'язань по Оферті.</li>
                <li>Способи оплати:
                    <ul>
                        <li>Онлайн оплата банківськими картами.</li>
                        <li>Готівкова оплата при отриманні замовлення.</li>
                        <li>Оплата по інвойсу (рахунку-фактурі) + 5% до вартості замовлення.</li>
                        <li>Оплата через LiqPay</li>
                    </ul>
                </li>
            </ol>

            <h3>Гарантія, рекламації</h3>
            <ol>
                <li>Виконавець гарантує повернення Замовнику оплати за послугу в повному обсязі у випадках коли послуга не була надана Замовнику Виконавцем або не відповідає умовам Договір надання послуг.</li>
                <li>У разі отримання послуги неналежної якості, Замовник зобов'язується звернутися в офіс Виконавця в максимально короткі терміни для здійснення перевірки якості.</li>
                <li>При наявності обгрунтованих претензій за якістю наданої послуги (тобто виявлення ознак виконання Послуг не по узгодженому макету і технічному завданню) сторони складають, або Замовник направляє Виконавцю обґрунтовану претензію, із зазначенням: невідповідностей надання Послуг, а також викладає свої вимоги. Він також має право, не пізніше трьох днів з дати отримання, повернути неякісні екземпляри друкованої продукції Виконавцю.</li>
                <li>У разі якщо Замовник протягом трьох днів з моменту приймання Послуг не надішле Виконавцю письмової претензії і не поверне браковану продукцію, всі надані Послуги вважаються якісними, а всі зобов'язання Виконавця з надання Послуг виконаними належним чином.</li>
            </ol>

            <h3>Претензії та порядок вирішення спорів</h3>
            <ol>
                <li>Для вирішення спорів, пов'язаних з порушенням прав Замовника застосовується досудовий (претензійний) порядок вирішення спорів.</li>
                <li>Претензії Замовника пред'являються в письмовій формі на ім'я ФОП «Биля Д.М.», із зазначенням його юридичної адреси. Претензія може бути надіслана поштою рекомендованим листом з описом вкладення та з повідомленням про вручення або доставлена ​​в офіс Виконавця особисто.</li>
                <li>У претензії зазначаються: прізвище, ім'я, по батькові Заявника, телефон, адреса заявника, вид послуги, номер Замовлення, інформація про оплату Замовлення, вимоги Заявника, обставини, на яких ґрунтується вимога, перелік доданих до претензії документів та інших доказів неякісного товару або надання послуги неналежної якості. Виконавець, отримавши претензію, зобов'язаний розглянути її і відповісти по суті претензії в десятиденний термін з дати отримання претензії. На її основі за погодженням сторін приймається рішення про подальші дії Виконавця: повна переробка або доробка Замовлення, пропорційне зменшення ціни продукції, надання знижки на наступні Послуги і т.п.</li>
                <li> Усі спори, що виникають з цього Договору, не врегульовані в претензійному порядку, підлягають розгляду в Господарському суді м.Києва відповідно до чинного законодавства України.</li>
            </ol>


            <h3>Конфіденційність та авторські права</h3>
            <ol>
                <li>Виконавець зобов'язується не передавати зміст робіт Замовника третім особам, а також не розголошувати інші відомості про Замовника, які стали йому відомі в процесі виконання зобов'язань за цим Договором, якщо інше прямо не випливає зі змісту і умов Договору.</li>
                <li>Виконавець має право не комерційно використовувати макет Замовника в електронному вигляді, а також виготовлені Виконавцем одиничні екземпляри друкованої продукції за згодою Замовника з метою демонстрації зразків виконаних Виконавцем робіт.</li>
                <li>Вся текстова інформація та графічні зображення, розміщені на інтернет-сайті <Link to="/" target="_blank" >https://printlab.biz.ua</Link> є власністю Виконавця та/або його клієнтів.</li>
                <li>Виконавець не приймає претензій третіх осіб про порушення авторських прав в надісланих Замовником макетах.</li>
                <li>Відповідальність за дотримання авторських і суміжних прав лежить виключно на Замовнику.</li>
            </ol>

            <h3>Умови використання сайту</h3>
            <p>
            Послуга надається «як є». Якщо ви збираєтеся використовувати цей сайт, уважно вивчіть дану оферту. Якщо ви не згодні з умовами або не ознайомилися з ними, не використовуйте Сайт. Виконавець не несе відповідальності за використання сайту, якщо інформація, розміщена на даному сайті, не є точною, повною або своєчасною. Матеріали, розміщені на цьому сайті надаються тільки для загальної інформації і не слід покладатися або використовувати їх в якості єдиної основи для прийняття рішень без консультацій з первинними, більш точними, більш повними або більш своєчасними джерелами інформації. Засновуючи свої дії на матеріалах, що знаходяться на цьому сайті, ви робите це на свій страх і ризик. Заборонено використовувати продукти Виконавця в т.ч. Сайт в цілому або будь-яку його частину для будь-яких незаконних і / або недозволених цілей. Заборонено порушувати закони у вашій юрисдикції при використанні Сервісу (включаючи, але не обмежуючись авторськими правами). Заборонено передавати будь-які віруси або будь-який інший код руйнівного характеру. Порушення будь-якої умови призведе до негайного припинення дії Сервісу для вас. Реєструючись на Сайті, ви приймаєте згоду надати конфіденційну інформацію. Ви самостійно несете відповідальність за безпеку ваших реєстраційних даних і за дії вчинені від імені ваших реєстраційних даних. У разі втрати реєстраційних даних ви зобов'язуєтеся повідомити про це адміністратора сайту для блокування. Відповідальність за будь-яку інформацію розміщену відвідувачами або користувачами Сайту, його власники і адміністратори не несуть. Будь-яке повідомлення залишене відвідувачем або користувачем Сайт може видалити на свій розсуд без пояснення причин. За будь-якої моральної або матеріальної шкоди завданої діями або повідомленнями користувачів або відвідувачів відповідальність несе автор дії або повідомлення. Користувач розуміє , що дані (не включаючи інформацію про платіжні картки), можуть бути передані в незашифрованому вигляді і включати в себе: (а) передачу по різних мережах; (Б) зміни для відповідності технічним вимогам зв'язуючих мереж або пристроїв. Інформація про платіжну картку завжди шифрується під час передачі даних по мережах. Заголовки, що використовуються в цій угоді, включені тільки для зручності і не обмежуватимуть або іншим чином впливати на ці умови.
            </p>

            <h3>Інші умови</h3>
            <ol>
                <li>Замовник зобов'язується самостійно знайомитися з умовами Договору. Розміщуючи замовлення, Замовник тим самим підтверджує, що він ознайомився з умовами цього Договору, вони йому зрозумілі і він приймає їх  в повному обсязі.</li>
                <li>Сторони можуть укласти індивідуальний Договір про надання поліграфічних послуг. В цьому випадку умови Договору будуть мати переважне значення щодо даного Договору-оферти.</li>
                <li>Сторони звільняються від виконання умов цього Договору в разі настання обставин непереборної сили згідно з визначеннями Торгово-Промислової Палати України.</li>
                <li>Виконавець не бере на себе ніяких зобов'язань щодо оновлення, зміни або уточнення інформації в сервісі або на будь-якому веб-сайті пов'язаному з інформацією про ціни, за винятком випадків, передбачених законом. Якщо не вказана дата відповідного оновлення, не слід розуміти, що вся інформація в сервісі або на будь-якому веб-сайті відповідно була змінена або була поновлена.</li>
                <li>Замовник може переглянути останню версію в будь-який час на цій сторінці.</li>
                <li>Виконавець залишає за собою право на свій власний розсуд оновлювати, змінювати або замінити будь-яку частину цієї Оферти шляхом розміщення оновлень і змін на Сайті.</li>
            </ol>
        </div>
        </React.Fragment>,
        ru:<React.Fragment>
        <div className="terms-container">
            <center><h2>Договор оказания услуг printlab.biz.ua</h2></center>
            <h3>Преамбула</h3>
            <ol>
                <li>
                    По настоящему Договору одна сторона Исполнитель с одной стороны, и любое лицо, принявшее условия настоящего Договора публичной оферты - Заказчик, с другой стороны, далее совместно именуемые  - Стороны, заключили настоящий Договор публичной оферты (далее - Оферта), адресованный неограниченному кругу лиц, являющийся официальным публичным предложением Исполнителя заключить с Заказчиками договор на оказание полиграфических услуг с использованием Веб-сайта <Link to="/" target="_blank" >https://printlab.biz.ua</Link>.
                </li>
                <li>
                    Настоящий Договор-Оферта не требует двустороннего подписания и действителен в электронном виде. Договор считается заключенным и приобретает силу договора присоединения с момента получения письменного подтверждения Заказчиком заказа на оказание услуг, в случае отсутствия такого подтверждения, с момента оплаты Заказчиком соответствующего заказа (акцепт договора Заказчиком). Письменным подтверждением заказа считается сообщение, полученное от Заказчика по факсу, электронной почте, через форму заказа на сайте Исполнителя (<Link to="/" target="_blank" >https://printlab.biz.ua</Link>), либо другим способом, и содержащее явно выраженное намерение Заказчика считать себя заключившим с Исполнителем договор на оказание услуг. Действия, подтверждающие заказ, означают, что Заказчик принимает полностью и безоговорочно все условия Договора без каких-либо изъятий и/или ограничений.
                </li>
                <li>
                    Настоящий договор-оферта опубликован по адресу: <Link to="/" target="_blank" >https://printlab.biz.ua</Link> Исполнитель оставляет за собой право вносить изменения в настоящую Оферту, в связи с чем Заказчик обязуется регулярно отслеживать изменения в Оферте, размещенной на сайте по соответствующему адресу.
                </li>
                <li>
                    Совершая действия по акцепту настоящего публичного договора-оферты, Заказчик подтверждает свою правоспособность и дееспособность, достижение Заказчиком возраста 18 лет, а также законное право Заказчика вступать в договорные отношения с Исполнителем.
                </li>
            </ol>

            <h3>Общие положения</h3>
            <ol>
                <li>Исполнитель - ФЛП “Быля Д.Н”, которому принадлежит сайт, и которое  производит печатную продукцию.</li>
                <li>Заказчик - любое лицо, принявшее условия настоящего Договора публичной оферты и заказывающий полиграфические услуги у Исполнителя.</li>
                <li>Стороны: пользователь согласно «Оферты» именуемый далее как Заказчик и юридическое лицо согласно «Оферты» именуемое далее как Исполнитель.</li>
                <li>Сайт, Сервис - сайт услуги <Link to="/" target="_blank" >https://printlab.biz.ua</Link>, а также производный сервис производства печатной продукции.</li>
                <li>Исполнитель предоставляет полиграфические услуги и выполняет полиграфические заказы (далее – Заказы) в соответствии с действующим прейскурантом, а Заказчик производит оплату и принимает оказанные услуги в соответствии с условиями настоящего Договора.</li>
                <li>Конкретное наименование, характеристики и другие важные показатели оказываемых услуг указываются Заказчиком при оформлении Заказа и считаются неотъемлемой частью настоящего Договора.</li>
            </ol>
            <h3>Производство продукции</h3>
            <ol>
                <li>Макет - подлежащий печати набор визуальных символов, который Заказчик передает Исполнителю посредством Сайта и который соответствует параметрам, указанным в разделе “Требованиям к макетам” данной Оферты.</li>
                <li>Заказчик передает Исполнителю макет в соответствии с «Требования к макетам» или самостоятельно несет всю ответственность за полученный результат.</li>
                <li>Заказчик самостоятельно несет всю ответственность за любую информацию, указанную в макетах.</li>
                <li>Исполнитель оказывает Услуги в сроки и на условиях, согласованных Сторонами при оформлении заказа. Обычный срок исполнения Заказа составляет от одного рабочего часа до двух недель, в зависимости от его сложности.</li>
                <li>Исполнитель вправе оказывать Услуги Заказчику по частям только с письменного согласия Заказчика.</li>
                <li>Исполнитель может отказать в выполнении услуг без объяснения причин Заказчику.</li>
                <li>Ответственность Исполнителя связанная с невыполнением или ненадлежащим выполнением услуги ограничивается суммой оплаченной за данную услугу Заказчиком Исполнителю и не может быть передана третьим лицам или перенесена на третьих лиц.</li>
                <li>В случае, если Заказчиком нарушаются сроки передачи Исполнителю макета, или при возникновении у Заказчика необходимости внести в него изменения или дополнения, Исполнитель вправе увеличить согласованный сторонами срок исполнения заказа, уведомив об этом Заказчика. При увеличении по инициативе Заказчика ранее согласованного объема работ, стоимость и срок его выполнения согласуются Сторонами дополнительно.</li>
                <li>Исполнитель имеет право в любое время на свое усмотрение и без информирования Заказчика изменять документы Исполнителя «Печать продукции» и «Требования к макетам».</li>
                <li>Заказчик самостоятельно определяет необходимый набор услуг в рамках представленных на сайте параметров заказа.</li>
                <li>Заказчик самостоятельно определяет материал для печати до начала печати на основе образов из представительств Исполнителя.</li>
                <li>В случае, если макет не соответствует техническим требованиям Исполнителя, указанным в разделе “Требования к макету” данной Оферты, Заказчик обязуется: в трехдневный срок, за свой счет и своими силами доработать макет и привести его в соответствие с параметрами раздела “Требования к макету” данной Оферты, либо известить Исполнителя о необходимости доработки макета силами Исполнителя. В этом случае, доработка осуществляется за дополнительную плату и в согласованные Сторонами сроки, на основании дополнительного счета, выставляемого Исполнителем.</li>
                <li>В случае доработки макета Исполнителем и после подписания доработанного оригинал-макета Заказчиком, считается, что все сведения и параметры правильны, претензии к содержанию такого макета (либо к продукции, произведенной на его основании) Исполнителем не принимаются;</li>
            </ol>

            <h3 className="subtitle">Требования к макетам</h3>

            <h3>Печать продукции</h3>
            <p>В предоставляемых услугах допустимы:</p>
            <ol>
                <li>Несовмещение изображения с двух сторон листа до 2 мм.</li>
                <li>До 2 мм несоответствие планируемому размеру.</li>
                <li>До 2 мм несоответствие планируемому месту порезки, высечки, сгиба, биговки, перфорации, тиснения, конгрева, выборочного лакирования.</li>
                <li>Присутствие неравномерности или неоднородности в красочном или лаковом покрытии.</li>
                <li>Отличия в отображении одного и того же цвета на разных экземплярах и в разных местах одного экземпляра.</li>
                <li>Отклонение параметров от пробного экземпляра.</li>
                <li>Наличие воздушных пузырьков и пылинок в ламинированном и лакированном покрытии.</li>
                <li>Наличие трещин в бумаге, краске, лаковом и ламинированном покрытии в местах сгиба, биговки, вырубки, высечки, порезки.</li>
                <li>Не плавное отображение перехода из одного цвета в другой.</li>
                <li>Неравномерность и отставание красочного, лакового и ламинированного покрытия.</li>
                <li>Загиб листа в месте порезки.</li>
                <li>Присутствие ошибок сделанных заказчиком или представителями или подрядчиками заказчика: в тексте, в цифрах, в параметрах цвета, в изображениях.</li>
                <li>Несоответствие мнению любого третьего лица о состоянии и качестве оказанных услуг.</li>
                <li>Несоответствие личного представления о результате и восприятия отображения цвета, контраста, относительного размера элементов, границ элементов, толщины линий и элементов печатаемого изображения на мониторе и после печати.</li>
                <li>Встраиваемый в файл цветовой профиль будет удалён.</li>
            </ol>

            <h3>Условия отгрузки продукции и доставка</h3>
            <ol>
                <li>Продукция отгружается по готовности и после 100% предоплаты.</li>
                <li>Право собственности на Заказ, а также риск его случайной утраты или повреждения переходят к Заказчику с момента получения Заказа.</li>
                <li>Исполнитель уведомляет Заказчика об оказании Услуг одним из следующих способов: по телефону, по факсу, электронной почте, путем отправки электронного текстового сообщения. Отправка такого уведомления означает наличие готовой печатной продукции на складе Исполнителя и готовность печатной продукции к отгрузке, а также необходимость для Заказчика принять Продукцию.</li>
                <li>Заказчик может забрать/принять готовую продукцию несколькими способами:
                    <ul>
                        <li>самостоятельно и бесплатно из офиса Исполнителя по адресу г. Киев, ул Мстислава Патриарха Скрипника, 40;</li>
                        <li>курьером по Киеву. Курьерская доставка оплачивается отдельно.</li>
                        <li>доставка по  Украине - “Новой Почтой”;</li>
                    </ul>
                </li>
            </ol>

            <h3>Оплата и цена</h3>
            <ol>
                <li>Все цены указанные на сайте актуальны в течении одного дня и действительны только для заказа сделанного непосредственно с этого сайта при условии стандартного срока выполнения: готовность по мере выполнения.</li>
                <li>Цена не включает: доставку, изготовление макета, доделки и переделки макета, ускоренное выполнение заказа.</li>
                <li>Заказчик оплачивает услуги Исполнителя после проверки Исполнителем макетов переданных Заказчиком на соответствие заказанным услугам.</li>
                <li>В случае организации доставки Исполнителем Заказчику, Заказчик самостоятельно оплачивает доставку и берет на себя все риски связанные с невыполнением или ненадлежащим выполнением доставки.</li>
                <li>Расценки оказания услуг размещены на сайте Исполнителя. Заказчик знакомится с ними самостоятельно. Окончательная стоимость Услуг при необходимости может быть согласована Сторонами дополнительно. Считается, что Заказчик, направляя Исполнителю заявку на оказание Услуг, с указанными расценками ознакомлен и согласен на их применение.</li>
                <li>Исполнитель не несет ответственности перед Заказчиком или любой третьей стороной за любые изменения, изменения цен, приостановление или прекращение Услуг.</li>
                <li>Заказчик оплачивает Услуги любым из указанных ниже способов на счет Исполнителя авансовым платежом в размере 100% стоимости Услуг в течение трех банковских дней с момента подтверждения заказа. По требованию Заказчика Исполнитель составляет счет и выставляет его Заказчику для оплаты. Счет может быть передан по электронной почте, факсу, либо любым другим согласованным Сторонами способом. Подтверждением оплаты является зачисление средств на счет банка-эмитента.</li>
                <li>Заказчик имеет право отказаться от оказания Услуг, письменно уведомив об этом Исполнителя. В этом случае Исполнитель обязуется возвратить Заказчику перечисленные денежные средства, за вычетом фактически понесенных расходов, а Заказчик обязан возместить Исполнителю убытки, связанные с отказом от исполнения обязательств по Оферте.</li>
                <li>Способы оплаты:
                    <ul>
                        <li>Онлайн оплата банковскими картами.</li>
                        <li>Наличная оплата при получении заказа.</li>
                        <li>Оплата по инвойсу (счету-фактуре) +5% к стоимости заказа.</li>
                        <li>Оплата через LiqPay</li>
                    </ul>
                </li>
            </ol>

            <h3>Гарантия, рекламации</h3>
            <ol>
                <li>Исполнитель гарантирует возврат Заказчику произведенных оплат за услугу в полном объеме в случаях когда услуга не была оказана Заказчику Исполнителем или не соответствует условиям Договор оказания услуг.</li>
                <li>В случае получении услуги ненадлежащего качества, Заказчик обязуется обратиться в офис Исполнителя в максимально короткие сроки для осуществления проверки качества.</li>
                <li>При наличии обоснованных претензий по качеству оказанной Услуги (т.е. обнаружения признаков выполнения Услуг не по согласованному макету и техническому заданию) стороны составляют, либо Заказчик направляет Исполнителю обоснованную претензию, с указанием: несоответствий оказания Услуг, а также излагает свои требования. Он также имеет право, не позднее трех дней с даты получения, вернуть некачественные экземпляры печатной продукции Исполнителю.</li>
                <li>В случае если Заказчик в течение трех дней с момента приемки Услуг не направит Исполнителю письменной претензии и не вернет бракованную продукцию, все оказанные Услуги считаются качественными, а все обязательства Исполнителя по оказанию Услуг исполненными надлежащим образом.</li>
            </ol>

            <h3>Претензии и порядок разрешения споров</h3>
            <ol>
                <li>Для разрешения споров, связанных с нарушением прав Заказчика применяется досудебный  (претензионный) порядок разрешения споров.</li>
                <li>Претензии Заказчика предъявляются в письменной форме на имя ФЛП “Быля Д.Н”, с указанием его юридического адреса. Претензия может быть направлена по почте заказным письмом с описью вложения и с уведомлением о вручении или доставлена в офис Исполнителя лично.</li>
                <li>В претензии указываются: фамилия, имя, отчество Заявителя, телефон, адрес Заявителя, характер услуги, номер Заказа, информация об оплате Заказа, требование Заявителя, обстоятельства, на которых основывается требование, перечень прилагаемых к претензии документов и других доказательств брака или предоставления услуги ненадлежащего качества.  Исполнитель,  получив претензию, обязан рассмотреть ее и ответить по существу претензии в десятидневный срок с даты получения претензии.  На ее основе по согласованию сторон принимается решение о дальнейших действиях Исполнителя: полная переделка или доделка Заказа, пропорциональное уменьшение цены продукции, предоставление скидки на последующие Услуги и т.п.</li>
                <li> Все споры, возникающие из настоящего Договора, не урегулированные в претензионном порядке, подлежат рассмотрению в Хозяйственном суде г. Киева В соответствии с действующим законодательством Украины.</li>
            </ol>


            <h3>Конфиденциальность и авторские права</h3>
            <ol>
                <li>Исполнитель обязуется не передавать содержание работ Заказчика третьим лицам, а также не разглашать иные ставшие ему известными в процессе исполнения обязательств по данному Договору сведения о Заказчике, если иное прямо не следует из смысла и условий Договора.</li>
                <li>Исполнитель вправе не коммерчески использовать макет Заказчика в электронном виде, а также изготовленные Исполнителем единичные экземпляры печатной продукции с согласия Заказчика в целях демонстрации образцов выполненных Исполнителем работ.</li>
                <li>Вся текстовая информация и графические изображения, размещенные на интернет-сайте <Link to="/" target="_blank" >https://printlab.biz.ua</Link> являются собственностью Исполнителя и/или его клиентов.</li>
                <li>Исполнитель не принимает претензий третьих лиц  о нарушении авторских прав в присланных Заказчиком макетах.</li>
                <li>Ответственность за очистку и соблюдение авторских и смежных прав лежит исключительно на Заказчике.</li>
            </ol>

            <h3>Условия использования сайта</h3>
            <p>
            Услуга предоставляется “как есть”. Если вы собираетесь использовать этот сайт, внимательно изучите данную оферту. Если вы не согласны с условиями или не ознакомились с ними, не используйте Сайт.
            Исполнитель не несет ответственности, если информация, представленная на данном сайте, не является точной, полной или своевременной. Материалы, размещенные на этом сайте предоставляются только для общей информации и не следует полагаться или использовать их в качестве единственной основы для принятия решений без консультаций с первичными, более точными, более полными или более своевременными источниками информации. Основывая свои действия на материалах, находящиеся на этом сайте, вы делаете это на свой страх и риск.
            Вы не можете использовать продукты Исполнителя в т.ч. Сайт вцелом или любую его часть для любых незаконных и/или неразрешенных целей. Вы не можете нарушать законы в вашей юрисдикции при использовании Сервиса (включая, но не ограничиваясь авторскими правами).
            Вы не должны передавать какие-либо вирусы или любой другой код разрушительного характера.
            Нарушение любого из условий Оферты приведет к немедленному прекращению действия Сервиса для вас.
            Регистрируясь на Сайте, вы принимаете согласие предоставить информацию о своих контактных данных и о себе. Вы самостоятельно несете ответственность за безопасность ваших регистрационных данных и за действия совершенные от имени ваших регистрационных данных. В случае потери регистрационных данных вы обязуетесь сообщить об этом администратору Сайта для блокировки.
            Ответственность за любую информацию размещенную посетителями или пользователями Сайт, его владельцы и администраторы не несут. Любое сообщение оставленное посетителем или пользователем Сайт может удалить на свое усмотрение без объяснения причин. За любой моральный или материальный вред нанесенный действиями или сообщениями пользователей или посетителей ответственность несет автор действия или сообщения.
            Вы понимаете, что ваши данные (не включая информацию о платежных картах), могут быть переданы в незашифрованном виде и включать в себя:
            (а) передачу по различным сетям;
            (б) изменения для соответствия техническим требованиям связующих сетей или устройств.
            Информация о платежной карте всегда шифруется во время передачи данных по сетям.
            Заголовки, используемые в настоящем соглашении, включены только для удобства и не будут ограничивать или иным образом влиять на эти условия.
            </p>

            <h3>Другие условия</h3>
            <ol>
                <li>Заказчик обязуется самостоятельно знакомиться с условиями Договора. Размещая заказ, Заказчик тем самым подтверждает, что он ознакомился с условиями настоящего Договора, они ему понятны и он принимает их безусловно и в полном объеме.</li>
                <li>Стороны могут заключить индивидуальный Договор на оказание полиграфических услуг. В этом случае условия этого Договора будут иметь преимущественное значение относительно данного Договора-оферты.</li>
                <li>Стороны освобождаются от выполнения условий настоящего договора в случае наступления обстоятельств непреодолимой силы в соответствии с определениями Торгово-Промышленной Палаты Украины.</li>
                <li>Исполнитель не берет на себя никаких обязательств по обновлению, изменению или уточнению информации в Сервисе или на любом веб-сайте связанном с нами, в том числе и без ограничений, информацию о ценах, за исключением случаев, предусмотренных законом. Если не указана дата соответствующего обновления, не следует понимать, что вся информация в Сервисе или на любом веб-сайте соответственно была изменена или обновлена.</li>
                <li>Заказчик может просмотреть самую последнюю версию Оферты в любое время на этой странице.</li>
                <li>Исполнитель оставляет за собой право, по своему собственному усмотрению, обновлять, изменять или заменить какую-либо часть настоящей Оферты путем размещения обновлений и изменений на Сайте.</li>
            </ol>
        </div>
        </React.Fragment>
    }

    return translations[locale];
};

export default Terms;