import React from 'react';
import { Link } from 'react-router-dom';

const Terms = e => (
    <React.Fragment>
        <div className="terms-container">
            <center><h2>Договор оказания услуг stikers.okprint.com.ua</h2></center>
            <h3>Преамбула</h3>
            <ol>
                <li>
                    По настоящему Договору одна сторона Исполнитель с одной стороны, и любое лицо, принявшее условия настоящего Договора публичной оферты - Заказчик, с другой стороны, далее совместно именуемые  - Стороны, заключили настоящий Договор публичной оферты (далее - Оферта), адресованный неограниченному кругу лиц, являющийся официальным публичным предложением Исполнителя заключить с Заказчиками договор на оказание полиграфических услуг с использованием Веб-сайта <Link to="/" target="_blank" >https://stikers.okprint.com.ua</Link>.
                </li>
                <li>
                    Настоящий Договор-Оферта не требует двустороннего подписания и действителен в электронном виде. Договор считается заключенным и приобретает силу договора присоединения с момента получения письменного подтверждения Заказчиком заказа на оказание услуг, в случае отсутствия такого подтверждения, с момента оплаты Заказчиком соответствующего заказа (акцепт договора Заказчиком). Письменным подтверждением заказа считается сообщение, полученное от Заказчика по факсу, электронной почте, через форму заказа на сайте Исполнителя (<Link to="/" target="_blank" >https://stikers.okprint.com.ua</Link>), либо другим способом, и содержащее явно выраженное намерение Заказчика считать себя заключившим с Исполнителем договор на оказание услуг. Действия, подтверждающие заказ, означают, что Заказчик принимает полностью и безоговорочно все условия Договора без каких-либо изъятий и/или ограничений.
                </li>
                <li>
                    Настоящий договор-оферта опубликован по адресу: <Link to="/" target="_blank" >https://stikers.okprint.com.ua</Link> Исполнитель оставляет за собой право вносить изменения в настоящую Оферту, в связи с чем Заказчик обязуется регулярно отслеживать изменения в Оферте, размещенной на сайте по соответствующему адресу.
                </li>
                <li>
                    Совершая действия по акцепту настоящего публичного договора-оферты, Заказчик подтверждает свою правоспособность и дееспособность, достижение Заказчиком возраста 18 лет, а также законное право Заказчика вступать в договорные отношения с Исполнителем.
                </li>
            </ol>

            <h3>Общие положения</h3>
            <ol>
                <li>Исполнитель - ФЛП “Быля Д.Н”, которому принадлежит сайт, и которое  производит печатную продукцию.</li>
                <li>Заказчик - любое лицо, принявшее условия настоящего Договора публичной оферты и заказывающий полиграфические услуги у Исполнителя.</li>
                <li>Стороны: пользователь согласно «Оферты» именуемый далее как Заказчик и юридическое лицо согласно «Оферты» именуемое далее как Исполнитель.</li>
                <li>Сайт, Сервис - сайт услуги <Link to="/" target="_blank" >https://stikers.okprint.com.ua</Link>, а также производный сервис производства печатной продукции.</li>
                <li>Исполнитель предоставляет полиграфические услуги и выполняет полиграфические заказы (далее – Заказы) в соответствии с действующим прейскурантом, а Заказчик производит оплату и принимает оказанные услуги в соответствии с условиями настоящего Договора.</li>
                <li>Конкретное наименование, характеристики и другие важные показатели оказываемых услуг указываются Заказчиком при оформлении Заказа и считаются неотъемлемой частью настоящего Договора.</li>
            </ol>
            <h3>Производство продукции</h3>
            <ol>
                <li>Макет - подлежащий печати набор визуальных символов, который Заказчик передает Исполнителю посредством Сайта и который соответствует параметрам, указанным в разделе “Требованиям к макетам” данной Оферты.</li>
                <li>Заказчик передает Исполнителю макет в соответствии с «Требования к макетам» или самостоятельно несет всю ответственность за полученный результат.</li>
                <li>Заказчик самостоятельно несет всю ответственность за любую информацию, указанную в макетах.</li>
                <li>Исполнитель оказывает Услуги в сроки и на условиях, согласованных Сторонами при оформлении заказа. Обычный срок исполнения Заказа составляет от одного рабочего часа до двух недель, в зависимости от его сложности.</li>
                <li>Исполнитель вправе оказывать Услуги Заказчику по частям только с письменного согласия Заказчика.</li>
                <li>Исполнитель может отказать в выполнении услуг без объяснения причин Заказчику.</li>
                <li>Ответственность Исполнителя связанная с невыполнением или ненадлежащим выполнением услуги ограничивается суммой оплаченной за данную услугу Заказчиком Исполнителю и не может быть передана третьим лицам или перенесена на третьих лиц.</li>
                <li>В случае, если Заказчиком нарушаются сроки передачи Исполнителю макета, или при возникновении у Заказчика необходимости внести в него изменения или дополнения, Исполнитель вправе увеличить согласованный сторонами срок исполнения заказа, уведомив об этом Заказчика. При увеличении по инициативе Заказчика ранее согласованного объема работ, стоимость и срок его выполнения согласуются Сторонами дополнительно.</li>
                <li>Исполнитель имеет право в любое время на свое усмотрение и без информирования Заказчика изменять документы Исполнителя «Печать продукции» и «Требования к макетам».</li>
                <li>Заказчик самостоятельно определяет необходимый набор услуг в рамках представленных на сайте параметров заказа.</li>
                <li>Заказчик самостоятельно определяет материал для печати до начала печати на основе образов из представительств Исполнителя.</li>
                <li>В случае, если макет не соответствует техническим требованиям Исполнителя, указанным в разделе “Требования к макету” данной Оферты, Заказчик обязуется: в трехдневный срок, за свой счет и своими силами доработать макет и привести его в соответствие с параметрами раздела “Требования к макету” данной Оферты, либо известить Исполнителя о необходимости доработки макета силами Исполнителя. В этом случае, доработка осуществляется за дополнительную плату и в согласованные Сторонами сроки, на основании дополнительного счета, выставляемого Исполнителем.</li>
                <li>В случае доработки макета Исполнителем и после подписания доработанного оригинал-макета Заказчиком, считается, что все сведения и параметры правильны, претензии к содержанию такого макета (либо к продукции, произведенной на его основании) Исполнителем не принимаются;</li>
            </ol>

            <h3 className="subtitle">Требования к макетам</h3>

            <h3>Печать продукции</h3>
            <p>В предоставляемых услугах допустимы:</p>
            <ol>
                <li>Несовмещение изображения с двух сторон листа до 2 мм.</li>
                <li>До 2 мм несоответствие планируемому размеру.</li>
                <li>До 2 мм несоответствие планируемому месту порезки, высечки, сгиба, биговки, перфорации, тиснения, конгрева, выборочного лакирования.</li>
                <li>Присутствие неравномерности или неоднородности в красочном или лаковом покрытии.</li>
                <li>Отличия в отображении одного и того же цвета на разных экземплярах и в разных местах одного экземпляра.</li>
                <li>Отклонение параметров от пробного экземпляра.</li>
                <li>Наличие воздушных пузырьков и пылинок в ламинированном и лакированном покрытии.</li>
                <li>Наличие трещин в бумаге, краске, лаковом и ламинированном покрытии в местах сгиба, биговки, вырубки, высечки, порезки.</li>
                <li>Не плавное отображение перехода из одного цвета в другой.</li>
                <li>Неравномерность и отставание красочного, лакового и ламинированного покрытия.</li>
                <li>Загиб листа в месте порезки.</li>
                <li>Присутствие ошибок сделанных заказчиком или представителями или подрядчиками заказчика: в тексте, в цифрах, в параметрах цвета, в изображениях.</li>
                <li>Несоответствие мнению любого третьего лица о состоянии и качестве оказанных услуг.</li>
                <li>Несоответствие личного представления о результате и восприятия отображения цвета, контраста, относительного размера элементов, границ элементов, толщины линий и элементов печатаемого изображения на мониторе и после печати.</li>
                <li>Встраиваемый в файл цветовой профиль будет удалён.</li>
            </ol>

            <h3>Условия отгрузки продукции и доставка</h3>
            <ol>
                <li>Продукция отгружается по готовности и после 100% предоплаты.</li>
                <li>Право собственности на Заказ, а также риск его случайной утраты или повреждения переходят к Заказчику с момента получения Заказа.</li>
                <li>Исполнитель уведомляет Заказчика об оказании Услуг одним из следующих способов: по телефону, по факсу, электронной почте, путем отправки электронного текстового сообщения. Отправка такого уведомления означает наличие готовой печатной продукции на складе Исполнителя и готовность печатной продукции к отгрузке, а также необходимость для Заказчика принять Продукцию.</li>
                <li>Заказчик может забрать/принять готовую продукцию несколькими способами:
                    <ul>
                        <li>самостоятельно и бесплатно из офиса Исполнителя по адресу г. Киев, ул Мстислава Патриарха Скрипника, 40;</li>
                        <li>курьером по Киеву. Курьерская доставка оплачивается отдельно.</li>
                        <li>доставка по  Украине - “Новой Почтой”;</li>
                    </ul>
                </li>
            </ol>

            <h3>Оплата и цена</h3>
            <ol>
                <li>Все цены указанные на сайте актуальны в течении одного дня и действительны только для заказа сделанного непосредственно с этого сайта при условии стандартного срока выполнения: готовность по мере выполнения.</li>
                <li>Цена не включает: доставку, изготовление макета, доделки и переделки макета, ускоренное выполнение заказа.</li>
                <li>Заказчик оплачивает услуги Исполнителя после проверки Исполнителем макетов переданных Заказчиком на соответствие заказанным услугам.</li>
                <li>В случае организации доставки Исполнителем Заказчику, Заказчик самостоятельно оплачивает доставку и берет на себя все риски связанные с невыполнением или ненадлежащим выполнением доставки.</li>
                <li>Расценки оказания услуг размещены на сайте Исполнителя. Заказчик знакомится с ними самостоятельно. Окончательная стоимость Услуг при необходимости может быть согласована Сторонами дополнительно. Считается, что Заказчик, направляя Исполнителю заявку на оказание Услуг, с указанными расценками ознакомлен и согласен на их применение.</li>
                <li>Исполнитель не несет ответственности перед Заказчиком или любой третьей стороной за любые изменения, изменения цен, приостановление или прекращение Услуг.</li>
                <li>Заказчик оплачивает Услуги любым из указанных ниже способов на счет Исполнителя авансовым платежом в размере 100% стоимости Услуг в течение трех банковских дней с момента подтверждения заказа. По требованию Заказчика Исполнитель составляет счет и выставляет его Заказчику для оплаты. Счет может быть передан по электронной почте, факсу, либо любым другим согласованным Сторонами способом. Подтверждением оплаты является зачисление средств на счет банка-эмитента.</li>
                <li>Заказчик имеет право отказаться от оказания Услуг, письменно уведомив об этом Исполнителя. В этом случае Исполнитель обязуется возвратить Заказчику перечисленные денежные средства, за вычетом фактически понесенных расходов, а Заказчик обязан возместить Исполнителю убытки, связанные с отказом от исполнения обязательств по Оферте.</li>
                <li>Способы оплаты:
                    <ul>
                        <li>Онлайн оплата банковскими картами.</li>
                        <li>Наличная оплата при получении заказа.</li>
                        <li>Оплата по инвойсу (счету-фактуре) +5% к стоимости заказа.</li>
                        <li>Оплата через LiqPay</li>
                    </ul>
                </li>
            </ol>

            <h3>Гарантия, рекламации</h3>
            <ol>
                <li>Исполнитель гарантирует возврат Заказчику произведенных оплат за услугу в полном объеме в случаях когда услуга не была оказана Заказчику Исполнителем или не соответствует условиям Договор оказания услуг.</li>
                <li>В случае получении услуги ненадлежащего качества, Заказчик обязуется обратиться в офис Исполнителя в максимально короткие сроки для осуществления проверки качества.</li>
                <li>При наличии обоснованных претензий по качеству оказанной Услуги (т.е. обнаружения признаков выполнения Услуг не по согласованному макету и техническому заданию) стороны составляют, либо Заказчик направляет Исполнителю обоснованную претензию, с указанием: несоответствий оказания Услуг, а также излагает свои требования. Он также имеет право, не позднее трех дней с даты получения, вернуть некачественные экземпляры печатной продукции Исполнителю.</li>
                <li>В случае если Заказчик в течение трех дней с момента приемки Услуг не направит Исполнителю письменной претензии и не вернет бракованную продукцию, все оказанные Услуги считаются качественными, а все обязательства Исполнителя по оказанию Услуг исполненными надлежащим образом.</li>
            </ol>

            <h3>Претензии и порядок разрешения споров</h3>
            <ol>
                <li>Для разрешения споров, связанных с нарушением прав Заказчика применяется досудебный  (претензионный) порядок разрешения споров.</li>
                <li>Претензии Заказчика предъявляются в письменной форме на имя ФЛП “Быля Д.Н”, с указанием его юридического адреса. Претензия может быть направлена по почте заказным письмом с описью вложения и с уведомлением о вручении или доставлена в офис Исполнителя лично.</li>
                <li>В претензии указываются: фамилия, имя, отчество Заявителя, телефон, адрес Заявителя, характер услуги, номер Заказа, информация об оплате Заказа, требование Заявителя, обстоятельства, на которых основывается требование, перечень прилагаемых к претензии документов и других доказательств брака или предоставления услуги ненадлежащего качества.  Исполнитель,  получив претензию, обязан рассмотреть ее и ответить по существу претензии в десятидневный срок с даты получения претензии.  На ее основе по согласованию сторон принимается решение о дальнейших действиях Исполнителя: полная переделка или доделка Заказа, пропорциональное уменьшение цены продукции, предоставление скидки на последующие Услуги и т.п.</li>
                <li> Все споры, возникающие из настоящего Договора, не урегулированные в претензионном порядке, подлежат рассмотрению в Хозяйственном суде г. Киева В соответствии с действующим законодательством Украины.</li>
            </ol>


            <h3>Конфиденциальность и авторские права</h3>
            <ol>
                <li>Исполнитель обязуется не передавать содержание работ Заказчика третьим лицам, а также не разглашать иные ставшие ему известными в процессе исполнения обязательств по данному Договору сведения о Заказчике, если иное прямо не следует из смысла и условий Договора.</li>
                <li>Исполнитель вправе не коммерчески использовать макет Заказчика в электронном виде, а также изготовленные Исполнителем единичные экземпляры печатной продукции с согласия Заказчика в целях демонстрации образцов выполненных Исполнителем работ.</li>
                <li>Вся текстовая информация и графические изображения, размещенные на интернет-сайте <Link to="/" target="_blank" >https://stikers.okprint.com.ua</Link> являются собственностью Исполнителя и/или его клиентов.</li>
                <li>Исполнитель не принимает претензий третьих лиц  о нарушении авторских прав в присланных Заказчиком макетах.</li>
                <li>Ответственность за очистку и соблюдение авторских и смежных прав лежит исключительно на Заказчике.</li>
            </ol>

            <h3>Условия использования сайта</h3>
            <p>
            Услуга предоставляется “как есть”. Если вы собираетесь использовать этот сайт, внимательно изучите данную оферту. Если вы не согласны с условиями или не ознакомились с ними, не используйте Сайт.
            Исполнитель не несет ответственности, если информация, представленная на данном сайте, не является точной, полной или своевременной. Материалы, размещенные на этом сайте предоставляются только для общей информации и не следует полагаться или использовать их в качестве единственной основы для принятия решений без консультаций с первичными, более точными, более полными или более своевременными источниками информации. Основывая свои действия на материалах, находящиеся на этом сайте, вы делаете это на свой страх и риск.
            Вы не можете использовать продукты Исполнителя в т.ч. Сайт вцелом или любую его часть для любых незаконных и/или неразрешенных целей. Вы не можете нарушать законы в вашей юрисдикции при использовании Сервиса (включая, но не ограничиваясь авторскими правами).
            Вы не должны передавать какие-либо вирусы или любой другой код разрушительного характера.
            Нарушение любого из условий Оферты приведет к немедленному прекращению действия Сервиса для вас.
            Регистрируясь на Сайте, вы принимаете согласие предоставить информацию о своих контактных данных и о себе. Вы самостоятельно несете ответственность за безопасность ваших регистрационных данных и за действия совершенные от имени ваших регистрационных данных. В случае потери регистрационных данных вы обязуетесь сообщить об этом администратору Сайта для блокировки.
            Ответственность за любую информацию размещенную посетителями или пользователями Сайт, его владельцы и администраторы не несут. Любое сообщение оставленное посетителем или пользователем Сайт может удалить на свое усмотрение без объяснения причин. За любой моральный или материальный вред нанесенный действиями или сообщениями пользователей или посетителей ответственность несет автор действия или сообщения.
            Вы понимаете, что ваши данные (не включая информацию о платежных картах), могут быть переданы в незашифрованном виде и включать в себя:
            (а) передачу по различным сетям;
            (б) изменения для соответствия техническим требованиям связующих сетей или устройств.
            Информация о платежной карте всегда шифруется во время передачи данных по сетям.
            Заголовки, используемые в настоящем соглашении, включены только для удобства и не будут ограничивать или иным образом влиять на эти условия.
            </p>

            <h3>Другие условия</h3>
            <ol>
                <li>Заказчик обязуется самостоятельно знакомиться с условиями Договора. Размещая заказ, Заказчик тем самым подтверждает, что он ознакомился с условиями настоящего Договора, они ему понятны и он принимает их безусловно и в полном объеме.</li>
                <li>Стороны могут заключить индивидуальный Договор на оказание полиграфических услуг. В этом случае условия этого Договора будут иметь преимущественное значение относительно данного Договора-оферты.</li>
                <li>Стороны освобождаются от выполнения условий настоящего договора в случае наступления обстоятельств непреодолимой силы в соответствии с определениями Торгово-Промышленной Палаты Украины.</li>
                <li>Исполнитель не берет на себя никаких обязательств по обновлению, изменению или уточнению информации в Сервисе или на любом веб-сайте связанном с нами, в том числе и без ограничений, информацию о ценах, за исключением случаев, предусмотренных законом. Если не указана дата соответствующего обновления, не следует понимать, что вся информация в Сервисе или на любом веб-сайте соответственно была изменена или обновлена.</li>
                <li>Заказчик может просмотреть самую последнюю версию Оферты в любое время на этой странице.</li>
                <li>Исполнитель оставляет за собой право, по своему собственному усмотрению, обновлять, изменять или заменить какую-либо часть настоящей Оферты путем размещения обновлений и изменений на Сайте.</li>
            </ol>
        </div>
        </React.Fragment>
    );

export default Terms;